app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "total_pages", "revision_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Programacao"], ["author", "Autor Qualquer"], ["total_pages", 200], ["revision_number", "3"], ["created_at", "2016-07-03 15:05:40.288121"], ["updated_at", "2016-07-03 15:05:40.288121"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "revision_number" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["revision_number", "7"], ["updated_at", "2016-07-03 15:08:00.782550"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)