app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("name", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Vasco"], ["country", "Brasil"], ["created_at", "2016-07-03 12:46:26.405096"], ["updated_at", "2016-07-03 12:46:26.405096"]]